//==================================================================================================================================
//
//６月３０日：魔法を実装[magic.cpp]
//Author:ShinaTaiyo
//
//==================================================================================================================================

//===================================================================
//インクルード
//===================================================================
#include "magic.h"
#include "texture.h"
#include "manager.h"
//==================================================================================================================================

//===================================================================
//静的メンバ宣言
//===================================================================
const char* CMagicDisp::m_MAGICDISP_FILENAME[CMagicDisp::MAGICDISP_MAX] =
{
	"data\\TEXTURE\\UI\\MagicDisp_Fire_000.png",
	"data\\TEXTURE\\UI\\MagicDisp_Beam_000.png",
	"data\\TEXTURE\\UI\\MagicDisp_Ice_000.png",
	"data\\TEXTURE\\UI\\MagicDisp_Thunder_000.png",
	"data\\TEXTURE\\UI\\MagicDisp_Sword_000.png",
	"data\\TEXTURE\\UI\\MagicDisp_PlantShield.png",
	"data\\TEXTURE\\UI\\MagicDisp_QuickHeal.png",
	"data\\TEXTURE\\UI\\MagicDisp_CrossBomb.png",
	"data\\TEXTURE\\UI\\MagicDisp_BlackHole.png",
	"data\\TEXTURE\\UI\\MagicDisp_PhycoBurst.png",
};

//==========================================<<<魔法ウインドウクラス>>>=====================================================================================

//===================================================================
//コンストラクタ
//===================================================================
CMagicWindow::CMagicWindow()
{
}
//==================================================================================================================================

//===================================================================
//デストラクタ
//===================================================================
CMagicWindow::~CMagicWindow()
{

}
//==================================================================================================================================

//===================================================================
//初期化処理
//===================================================================
HRESULT CMagicWindow::Init()
{
	CObject2D::Init();        //2Dオブジェクト初期化
	m_nHaveMagic = 0;         //現在持っている魔法
	return S_OK;
}
//==================================================================================================================================


//===================================================================
//終了処理
//===================================================================
void CMagicWindow::Uninit()
{
	CObject2D::Uninit();//2Dオブジェクト終了
}
//==================================================================================================================================

//===================================================================
//別枠の終了処理
//===================================================================
void CMagicWindow::ExtraUninit()
{
}
//==================================================================================================================================

//===================================================================
//更新処理
//===================================================================
void CMagicWindow::Update()
{
	CObject2D::Update();
}
//==================================================================================================================================

//===================================================================
//描画処理
//===================================================================
void CMagicWindow::Draw()
{
	CObject2D::Draw();//2Dオブジェクト描画処理
}
//==================================================================================================================================

//===================================================================
//死亡フラグを設定する
//===================================================================
void CMagicWindow::SetDeath()
{
	CObject::SetDeath();
}
//==================================================================================================================================

//===================================================================
//生成処理
//===================================================================
CMagicWindow* CMagicWindow::Create(float fWidth, float fHeight, D3DXVECTOR3 pos)
{
	CMagicWindow* pMagicWindow = DBG_NEW CMagicWindow;                             //魔法ウインドウを生成
	bool bSuccess = pMagicWindow->CObject::GetCreateSuccess();         //生成が成功したかどうかを取得する
	if (bSuccess == true)
	{//生成が成功したら
		if (pMagicWindow != nullptr)
		{
			pMagicWindow->Init();                                                                                 //初期化処理
			pMagicWindow->SetUseDeath(false); //死亡フラグを発動するかどうかを設定する
			pMagicWindow->SetWidth(fWidth);                               //横幅を設定
			pMagicWindow->SetHeight(fHeight);                             //高さを設定
			pMagicWindow->SetPos(pos);                                                                            //オブジェクト２Ｄの位置を設定
			pMagicWindow->CObject::SetType(CObject::TYPE_MAGICWINDOW);                                                  //オブジェクトの種類を決める
			pMagicWindow->SetTextureIndex(CManager::GetTexture()->Regist("data\\TEXTURE\\UI\\MagicWindow_000.png"));       //テクスチャを割り当てる
			pMagicWindow->BindTexture(CManager::GetTexture()->GetAddress(pMagicWindow->GetTextureIndex()));       //テクスチャを設定する
			pMagicWindow->SetInfo(1, 1, fWidth, fHeight, D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f), POLYGONTYPE01_SENTERROLLING, false); //ポリゴン情報を設定する

		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pMagicWindow;
		pMagicWindow = nullptr;
	}

	return pMagicWindow;
}
//==================================================================================================================================

//==========================================<<<魔法表示クラス>>>=====================================================================================

//===================================================================
//コンストラクタ
//===================================================================
CMagicDisp::CMagicDisp() : m_pLongPushUi(nullptr)
{
	

}
//===================================================================================================================================

//===================================================================
//デストラクタ
//===================================================================
CMagicDisp::~CMagicDisp()
{

}
//===================================================================================================================================

//===================================================================
//初期化処理
//===================================================================
HRESULT CMagicDisp::Init()
{
	CObject2D::Init();             //オブジェクト2D初期化
	m_Type = MAGICDISP00_FIRE;     //魔法表示の種類
	return S_OK;
}
//===================================================================================================================================


//===================================================================
//終了処理
//===================================================================
void CMagicDisp::Uninit()
{
	CObject2D::Uninit();           //オブジェクト2D終了処理
}
//===================================================================================================================================

//===================================================================
//別枠の終了処理
//===================================================================
void CMagicDisp::ExtraUninit()
{
}
//===================================================================================================================================

//===================================================================
//更新処理
//===================================================================
void CMagicDisp::Update()
{
	CObject2D::Update();           //オブジェクト2D更新処理
}
//===================================================================================================================================

//===================================================================
//描画処理
//===================================================================
void CMagicDisp::Draw()
{
	D3DXVECTOR3 Pos = GetPos();//現在の位置の取得
	CObject2D::Draw();             //オブジェクト2D描画処理
}
//===================================================================================================================================

//=================================================================
//死亡フラグを設定
//=================================================================
void CMagicDisp::SetDeath()
{
	if (m_pLongPushUi != nullptr)
	{
		m_pLongPushUi->SetUseDeath(true);
		m_pLongPushUi->SetDeath();
		m_pLongPushUi = nullptr;
	}

	CObject::SetDeath();
}
//===================================================================================================================================

//===================================================================
//生成処理
//===================================================================
CMagicDisp* CMagicDisp::Create(MAGICDISPTYPE Type, float fWidth, float fHeight, D3DXVECTOR3 pos)
{
	CMagicDisp* pMagicDisp = DBG_NEW CMagicDisp;                        //魔法表示を生成
	bool bSuccess = pMagicDisp->CObject::GetCreateSuccess();            //生成が成功したかどうかを取得する
	if (bSuccess == true)
	{//生成が成功したら
		if (pMagicDisp != nullptr)
		{
			pMagicDisp->Init();                                         //初期化処理
			pMagicDisp->SetWidth(fWidth);                               //横幅を設定
			pMagicDisp->SetHeight(fHeight);                             //高さを設定
			pMagicDisp->SetMagicDispType(Type);                         //魔法表示の種類を設定
			pMagicDisp->SetPos(pos);                                    //オブジェクト２Ｄの位置を設定
			pMagicDisp->CObject::SetType(CObject::TYPE_MAGICDISP);      //オブジェクトの種類を決める
	        pMagicDisp->SetTextureIndex(CManager::GetTexture()->Regist(m_MAGICDISP_FILENAME[Type]));       //テクスチャを割り当てる
			pMagicDisp->BindTexture(CManager::GetTexture()->GetAddress(pMagicDisp->GetTextureIndex()));       //テクスチャを設定する
			pMagicDisp->SetInfo(1, 1, fWidth, fHeight, D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f), POLYGONTYPE01_SENTERROLLING, false); //ポリゴン情報を設定する
			pMagicDisp->m_pLongPushUi = CUi::Create(CUi::UITYPE_LONGPUSH_TEXT, CObject2D::POLYGONTYPE01_SENTERROLLING, 100.0f, 100.0f, pos + D3DXVECTOR3(100.0f, 0.0f, 0.0f),
				NULL_VECTOR3, NULL_VECTOR3, NORMAL_COL);
			pMagicDisp->m_pLongPushUi->SetUseBlinking(true, 60, 0.0f);
			pMagicDisp->m_pLongPushUi->SetUseDraw(false);

		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pMagicDisp;
		pMagicDisp = nullptr;
	}

	return pMagicDisp;
}
//===================================================================================================================================

//===================================================================
//生成処理
//===================================================================
void CMagicDisp::SetMagicDispType(MAGICDISPTYPE Type)
{
	SetTextureIndex(CManager::GetTexture()->Regist(m_MAGICDISP_FILENAME[Type]));       //テクスチャを割り当てる
	m_Type = Type;                                                                              //タイプを設定する
	BindTexture(CManager::GetTexture()->GetAddress(GetTextureIndex()));                         //テクスチャを設定する

	if (m_pLongPushUi != nullptr)
	{
		if (Type == MAGICDISP06_QUICKHEAL || Type == MAGICDISP09_PHYCOBURST)
		{
			m_pLongPushUi->SetUseDraw(true);
		}
		else
		{
			m_pLongPushUi->SetUseDraw(false);
		}
	}
}
//===================================================================================================================================