//========================================================================
//
//８月１８日：ロックオンを作る[Ui3D.h]
//Author:ShinaTaiyo
//
//========================================================================

#ifndef _UI3D_H_  
#define _UI3D_H_

//======================
//インクルード
//======================
#include "main.h"
#include "billboard.h"

//==========================================

//======================
//前方宣言
//======================

//==========================================

//==========================================
//UI3Dクラス
//==========================================
class CUi3D : public CBillboard
{
public:
	//===========================
	//3DUiの種類
	//===========================
	typedef enum
	{
		UI3DTYPE00_LOCKON = 0, //ロックオン
		UI3DTYPE01_WARNING,    //警告表示
		UI3DTYPE_MAX
	}UI3DTYPE;
	//=========================================================================================================================

	//===========================
	//プロトタイプ宣言
	//===========================
	CUi3D();                        //コンストラクタ
	~CUi3D() override;              //デストラクタ
	HRESULT Init() override;        //初期化処理
	void Uninit() override;         //終了処理
	void Update() override;         //更新処理
	void Draw() override;           //描画処理
	void SetDeath() override;       //死亡フラグを設定
	static CUi3D* Create(UI3DTYPE type,int nLife,float fWidth, float fHeight, D3DXVECTOR3 pos, D3DXVECTOR3 move);//3DUiを生成
	//=========================================================================================================================
private:
	static const char* m_apUI3D_FILENAME[UI3DTYPE_MAX];   //ファイルネーム
	UI3DTYPE m_type;                                      //3DUiの種類
	bool m_bDrawSwitch;                                   //描画するかどうか
};

#endif
