//=============================================================================================================
//
//１２月１９日：イベントマネージャーを作成[number.cpp]
//Author:ShinaTaiyo
//
//==============================================================================================================

//========================================================
//インクルード
//========================================================
#include "number.h"
#include "texture.h"
#include "manager.h"
//==============================================================================================================

//========================================================
//コンストラクタ
//========================================================
CNumber::CNumber(int nPri, bool bUseintPri, CObject::TYPE type, CObject::OBJECTTYPE ObjType) : CObject2D(nPri,bUseintPri,type,ObjType),m_nNumber(0)
{

}
//==============================================================================================================

//========================================================
//デストラクタ
//========================================================
CNumber::~CNumber()
{

}
//==============================================================================================================

//========================================================
//初期化処理
//========================================================
HRESULT CNumber::Init()
{
	CObject2D::Init();//2Dオブジェクト初期化処理

	m_nNumber = 0;     //表示する数値
	return S_OK;
}
//==============================================================================================================

//========================================================
//終了処理
//========================================================
void CNumber::Uninit()
{
	CObject2D::Uninit();//2Dオブジェクト終了処理
}
//==============================================================================================================

//========================================================
//更新処理
//========================================================
void CNumber::Update()
{
	CObject2D::Update();//2Dオブジェクト更新処理
}
//==============================================================================================================

//========================================================
//描画処理
//========================================================
void CNumber::Draw()
{
	CObject2D::Draw();//2Dオブジェクト描画処理
}
//==============================================================================================================

//========================================================
//死亡フラグを設定
//========================================================
void CNumber::SetDeath()
{
	CObject2D::SetDeath();//オブジェクト2D死亡フラグ設定処理
}
//==============================================================================================================

//========================================================
//生成処理
//========================================================
CNumber* CNumber::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CNumber* pNumber = DBG_NEW CNumber;                                                              //数字を生成 
	pNumber->Init();                                                                                 //初期化処理
	pNumber->SetUseDeath(false);                                                                     //死亡フラグを発動するかどうかを設定する
	pNumber->SetPos(pos);                                                                            //オブジェクト２Ｄの位置を設定
	pNumber->CObject::SetType(CObject::TYPE::NUMBER);                                                //オブジェクトの種類を決める
	pNumber->SetTextureIndex(CManager::GetTexture()->Regist("data\\TEXTURE\\Number_000.png"));       //テクスチャを登録し、テクスチャ番号を設定
	pNumber->BindTexture(CManager::GetTexture()->GetAddress(pNumber->GetTextureIndex()));            //テクスチャを割り当てる
	pNumber->SetAnimInfo(10, 1, false);                                                              //アニメーション情報を設定
	pNumber->SetWidth(fWidth);                                                                       //横幅を設定
	pNumber->SetMaxWidth(fWidth);                                                                    //最大横幅を設定
	pNumber->SetHeight(fHeight);                                                                     //高さを設定
	pNumber->SetMaxHeight(fHeight);                                                                  //最大高さを設定
	pNumber->SetPolygonType(CObject2D::POLYGONTYPE::SENTERROLLING);                                  //ポリゴンの種類を設定
	return pNumber;
}
//==============================================================================================================