//=========================================================
//
// リザルト画面の処理に関するヘッダーファイル
// Author : Atsumu Kuboichi
//
//=========================================================
#ifndef _RESULT_H_
#define _RESULT_H

#include "main.h"

//=========================================================
// プロトタイプ宣言
//=========================================================
void InitResult(void);		//初期化処理
void UninitResult(void);	//終了処理
void UpdateResult(void);	//更新処理
void DrawResult(void);		//描画処理

#endif
