//========================================================================================================
//
//６月１７日：フェード処理実装
//Author:ShinaTaiyo
//
//========================================================================================================

//======================================================
//インクルード
//======================================================
#include "fade.h"
#include "debugtext.h"
#include "manager.h"
#include "scene.h"
//========================================================================================================

//======================================================
//コンストラクタ
//======================================================
CFade::CFade(int nPri, bool bUseintPri, CObject::TYPE type, CObject::OBJECTTYPE ObjType) : CObject2D(nPri,bUseintPri,type,ObjType),
m_FadeMode(FADEMODE_NONE),m_fAlpha(0.0f),m_nFadeCnt(0),m_nMaxFadeCnt(0), m_bStartFade(false)
{

}
//========================================================================================================

//======================================================
//デストラクタ
//======================================================
CFade::~CFade()
{

}
//========================================================================================================

//======================================================
//初期化処理
//======================================================
HRESULT CFade::Init()
{
	CObject2D::Init();         //オブジェクト2D初期化処理
	return S_OK;
}
//========================================================================================================

//======================================================
//終了処理
//======================================================
void CFade::Uninit()
{
	CObject2D::Uninit();
}
//========================================================================================================

//======================================================
//別枠の終了処理
//======================================================
void CFade::ExtraUninit()
{
	//Release();
}
//========================================================================================================

//======================================================
//更新処理
//======================================================
void CFade::Update()
{
	float fRatio = 0.0f;//フェードの進行度の割合
	bool bModeChenge = false;//モードが変わったかどうかのフラグ
	switch (m_FadeMode)
	{
	case FADEMODE_IN:
		m_nFadeCnt++;
		if (m_nFadeCnt >= m_nMaxFadeCnt)
		{
			m_nFadeCnt = m_nMaxFadeCnt;
		}
		fRatio = (float)(m_nFadeCnt) / (float)(m_nMaxFadeCnt);
		SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, fRatio), true, fRatio);
		break;
	case FADEMODE_OUT:
		m_nFadeCnt--;
		if (m_nFadeCnt <= 0)
		{
			m_nFadeCnt = 0;
			m_bStartFade = false;
		}

		fRatio = (float)(m_nFadeCnt) / (float)(m_nMaxFadeCnt);
		SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, fRatio), true, fRatio);
		break;
	default:
		break;
	}

	CManager::GetDebugText()->PrintDebugText("フェードを開始するかどうか：%d\n", m_bStartFade);

	if (bModeChenge == false)
	{
		CObject2D::Update();//オブジェクト2D更新処理
	}
}
//========================================================================================================

//======================================================
//描画処理
//======================================================
void CFade::Draw()
{
	D3DXCOLOR col = GetColor();
	if (col.a > 0.0f)
	{
		CObject2D::Draw();//オブジェクト2D描画処理
	}
}
//========================================================================================================

//======================================================
//死亡フラグを設定
//======================================================
void CFade::SetDeath()
{
	CObject2D::SetDeath();
}
//========================================================================================================

//======================================================
//フェードを設定
//======================================================
void CFade::SetFade(FADEMODE FadeMode)
{
	m_FadeMode = FadeMode;//フェードモードの設定
	switch (FadeMode)
	{
	case FADEMODE_IN:
		m_nFadeCnt = 0;
		break;
	case FADEMODE_OUT:
		m_nFadeCnt = m_nMaxFadeCnt;
		break;
	default:
		break;
	}
}
//========================================================================================================

//======================================================
//生成処理
//======================================================
CFade* CFade::Create()
{
	CFade* pFade = DBG_NEW CFade;                             //フェードを生成
    pFade->Init();                                                                                                        //初期化処理
    pFade->SetUseDeath(false);                                                   //死亡フラグを発動するかどうかを設定する
    pFade->CObject2D::SetAnimInfo(1, 1, true);//ポリゴンとテクスチャ情報を設定
    pFade->SetPos(D3DXVECTOR3(SCREEN_WIDTH / 2,SCREEN_HEIGHT / 2,0.0f));                                                                                        //中心に位置を設定
    pFade->m_nMaxFadeCnt = 45;                                                                                           //フェードカウント最大値
    pFade->CObject::SetType(CObject::TYPE::FADE);                                                                          //オブジェクトの種類を決める

	return pFade;
}
//========================================================================================================

//=========================================<<<<<<<<<<<シーンフェードクラス>>>>>>>>>>>======================================================================

//======================================================
//コンストラクタ
//======================================================
CSceneFade::CSceneFade() : m_NextMode(CScene::MODE_TITLE)
{

}
//========================================================================================================

//======================================================
//デストラクタ
//======================================================
CSceneFade::~CSceneFade()
{

}
//========================================================================================================

//======================================================
//初期化処理
//======================================================
HRESULT CSceneFade::Init()
{
	CFade::Init();
	return S_OK;
}
//========================================================================================================

//======================================================
//終了処理
//======================================================
void CSceneFade::Uninit()
{
	CFade::Uninit();
}
//========================================================================================================

//======================================================
//更新処理
//======================================================
void CSceneFade::Update()
{
	int& nFadeCnt = GetFadeCnt();
	int& nMaxFadeCnt = GetMaxFadeCnt();

	CFade::Update();
	if (nFadeCnt >= nMaxFadeCnt)
	{
		SetFadeMode(FADEMODE_OUT);
		CManager::SetMode(m_NextMode);
	}
	if (nFadeCnt <= 0)
	{
		SetFadeMode(FADEMODE_NONE);
	}


}
//========================================================================================================

//======================================================
//描画処理
//======================================================
void CSceneFade::Draw()
{
	CFade::Draw();
}
//========================================================================================================

//======================================================
//死亡フラグを設定する
//======================================================
void CSceneFade::SetDeath()
{
	CFade::SetDeath();
}
//========================================================================================================

//======================================================
//生成処理
//======================================================
CSceneFade* CSceneFade::Create()
{
	CSceneFade* pSceneFade = DBG_NEW CSceneFade;                             //フェードを生成
	bool bSuccess = pSceneFade->CObject::GetCreateSuccess();       //生成が成功したかどうかを取得する
	if (bSuccess == true)
	{//生成が成功したら
		if (pSceneFade != nullptr)
		{
			pSceneFade->Init();                                                                                                        //初期化処理
			pSceneFade->SetUseDeath(false);                                                   //死亡フラグを発動するかどうかを設定する
			pSceneFade->SetPos(D3DXVECTOR3(SCREEN_WIDTH / 2,SCREEN_HEIGHT / 2,0.0f));                                                                                        //中心に位置を設定
			pSceneFade->SetMaxFadeCnt(45);                                                                                           //フェードカウント最大値
			pSceneFade->CObject::SetType(CObject::TYPE::FADE);                                                                          //オブジェクトの種類を決める
			pSceneFade->SetAnimInfo(1,1,  false);//ポリゴン情報を設定
			pSceneFade->SetWidth(SCREEN_WIDTH / 2);
			pSceneFade->SetMaxWidth(SCREEN_WIDTH / 2);
			pSceneFade->SetHeight(SCREEN_WIDTH / 2);
			pSceneFade->SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f), false, 1.0f);
			pSceneFade->SetMaxHeight(SCREEN_WIDTH / 2);
			pSceneFade->SetPolygonType(CObject2D::POLYGONTYPE::NORMAL);
		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pSceneFade;
		pSceneFade = nullptr;
	}

	return pSceneFade;
}
//========================================================================================================

//======================================================
//フェードを設定する
//======================================================
void CSceneFade::SetSceneFade(FADEMODE FadeMode, CScene::MODE mode)
{
	if (GetStartFade() == false)
	{//フェードが開始していなければ
		SetStartFade(true);
		SetFadeMode(FadeMode);

		m_NextMode = mode;    //次のモード
		switch (FadeMode)
		{
		case FADEMODE_IN:
			SetFadeCnt(0);
			break;
		case FADEMODE_OUT:
			SetFadeCnt(GetMaxFadeCnt());
			break;
		default:
			break;
		}
	}
}
//========================================================================================================

//=========================================<<<<<<<<<<<演出フェードクラス>>>>>>>>>>>======================================================================

//======================================================
//コンストラクタ
//======================================================
CDirectionFade::CDirectionFade() : CFade(5)
{

}
//========================================================================================================

//======================================================
//デストラクタ
//======================================================
CDirectionFade::~CDirectionFade()
{

}
//========================================================================================================

//======================================================
//初期化処理
//======================================================
HRESULT CDirectionFade::Init()
{
	CFade::Init();
	return S_OK;
}
//========================================================================================================

//======================================================
//終了処理
//======================================================
void CDirectionFade::Uninit()
{
	CFade::Uninit();
}
//========================================================================================================

//======================================================
//更新処理
//======================================================
void CDirectionFade::Update()
{
	CFade::Update();
}
//========================================================================================================

//======================================================
//描画処理
//======================================================
void CDirectionFade::Draw()
{
	CFade::Draw();
}
//========================================================================================================

//======================================================
//死亡フラグ設定処理
//======================================================
void CDirectionFade::SetDeath()
{
	CFade::SetDeath();
}
//========================================================================================================

//======================================================
//生成処理
//======================================================
CDirectionFade* CDirectionFade::Create()
{
	CDirectionFade* pDirectionFade = DBG_NEW CDirectionFade;                             //フェードを生成
	bool bSuccess = pDirectionFade->CObject::GetCreateSuccess();       //生成が成功したかどうかを取得する
	if (bSuccess == true)
	{//生成が成功したら
		if (pDirectionFade != nullptr)
		{
			pDirectionFade->Init();                                                                                                        //初期化処理
			pDirectionFade->SetUseDeath(false);                                                   //死亡フラグを発動するかどうかを設定する
			pDirectionFade->SetAnimInfo(1, 1, false);//ポリゴン情報を設定
			pDirectionFade->SetWidth(SCREEN_WIDTH / 2);
			pDirectionFade->SetMaxWidth(SCREEN_WIDTH / 2);
			pDirectionFade->SetHeight(SCREEN_WIDTH / 2);
			pDirectionFade->SetMaxHeight(SCREEN_WIDTH / 2);
			pDirectionFade->SetPolygonType(CObject2D::POLYGONTYPE::NORMAL);
			pDirectionFade->SetPos(D3DXVECTOR3(SCREEN_WIDTH / 2,SCREEN_HEIGHT / 2,0.0f));                                                                                        //中心に位置を設定
			pDirectionFade->SetMaxFadeCnt(45);                                                                                           //フェードカウント最大値
			pDirectionFade->CObject::SetType(CObject::TYPE::FADE);                                                                          //オブジェクトの種類を決める
		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pDirectionFade;
		pDirectionFade = nullptr;
	}

	return pDirectionFade;
}
//========================================================================================================