//=============================================================================================================
//
//１２月１９日：イベントマネージャーを作成[number.cpp]
//Author:ShinaTaiyo
//
//==============================================================================================================

//========================================================
//インクルード
//========================================================
#include "number.h"
#include "texture.h"
#include "manager.h"
//==============================================================================================================

//========================================================
//コンストラクタ
//========================================================
CNumber::CNumber(int nPri, bool bUseintPri, CObject::TYPE type, CObject::OBJECTTYPE ObjType) : CObject2D(nPri,bUseintPri,type,ObjType),m_nNumber(0)
{

}
//==============================================================================================================

//========================================================
//デストラクタ
//========================================================
CNumber::~CNumber()
{

}
//==============================================================================================================

//========================================================
//初期化処理
//========================================================
HRESULT CNumber::Init()
{
	CObject2D::Init();//2Dオブジェクト初期化処理

	m_nNumber = 0;//表示する数値
	return S_OK;
}
//==============================================================================================================

//========================================================
//終了処理
//========================================================
void CNumber::Uninit()
{
	CObject2D::Uninit();//2Dオブジェクト終了処理
}
//==============================================================================================================

//========================================================
//別枠の終了処理
//========================================================
void CNumber::ExtraUninit()
{
}
//==============================================================================================================

//========================================================
//更新処理
//========================================================
void CNumber::Update()
{
	CObject2D::Update();//2Dオブジェクト更新処理
}
//==============================================================================================================

//========================================================
//描画処理
//========================================================
void CNumber::Draw()
{
	CObject2D::Draw();//2Dオブジェクト描画処理
}
//==============================================================================================================

//========================================================
//死亡フラグを設定
//========================================================
void CNumber::SetDeath()
{
	CObject2D::SetDeath();
}
//==============================================================================================================

//========================================================
//生成処理
//========================================================
CNumber* CNumber::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CNumber* pNumber = DBG_NEW CNumber;                           //弾を生成 
	bool bSuccess = pNumber->CObject::GetCreateSuccess();         //生成が成功したかどうかを取得する
	if (bSuccess == true)
	{//生成が成功したら
		if (pNumber != nullptr)
		{
			pNumber->Init();                                                                                 //初期化処理
			pNumber->SetUseDeath(false);                                                                     //死亡フラグを発動するかどうかを設定する
			pNumber->SetPos(pos);                                                                            //オブジェクト２Ｄの位置を設定
			pNumber->CObject::SetType(CObject::TYPE::NUMBER);                                                  //オブジェクトの種類を決める
			pNumber->SetTextureIndex(CManager::GetTexture()->Regist("data\\TEXTURE\\Number_000.png"));       //テクスチャを割り当てる
			pNumber->BindTexture(CManager::GetTexture()->GetAddress(pNumber->GetTextureIndex()));            //テクスチャを設定する
			pNumber->SetAnimInfo(10, 1, false);
			pNumber->SetWidth(fWidth);
			pNumber->SetMaxWidth(fWidth);
			pNumber->SetHeight(fHeight);
			pNumber->SetMaxHeight(fHeight);
			pNumber->SetPolygonType(CObject2D::POLYGONTYPE::SENTERROLLING);
		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pNumber;
		pNumber = nullptr;
	}

	return pNumber;
}
//==============================================================================================================