//==================================================================================
//
//６月４日：床クラス実装[field.cpp]
//Author:ShinaTaiyo
//
//==================================================================================

//==========================================
//インクルード
//==========================================
#include "field.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"
//===================================================================================

//==========================================
//静的メンバ初期化
//==========================================
LPDIRECT3DTEXTURE9 CField::m_pTextureTemp = nullptr;
//===================================================================================

//==========================================
//コンストラクタ
//==========================================
CField::CField()
{

}
//===================================================================================

//==========================================
//デストラクタ
//==========================================
CField::~CField()
{

}
//===================================================================================

//==========================================
//初期化処理
//==========================================
HRESULT CField::Init()
{
	CObject3D::Init();//3Dオブジェクト初期化
	return S_OK;
}
//===================================================================================

//===========================================
//終了処理
//===========================================
void CField::Uninit()
{
	CObject3D::Uninit();//3Dオブジェクト終了処理
	SetDeath();         //死亡フラグを設定
}
//===================================================================================

//===========================================
//別枠の終了処理
//===========================================
void CField::ExtraUninit()
{
}
//===================================================================================

//===========================================
//更新処理
//===========================================
void CField::Update()
{
	CObject3D::Update();//3Dオブジェクト更新処理
}
//===================================================================================

//===========================================
//描画処理
//===========================================
void CField::Draw()
{
	CObject3D::Draw();//3Dオブジェクト描画処理
}
//===================================================================================

//===========================================
//死亡フラグを設定
//===========================================
void CField::SetDeath()
{
	CObject::SetDeath();
}
//===================================================================================


//===========================================
//テクスチャのアンロード処理
//===========================================
void CField::Unload()
{
	if (m_pTextureTemp != nullptr)
	{
		m_pTextureTemp->Release();
		m_pTextureTemp = nullptr;
	}
}
//===================================================================================

//===========================================
//生成処理
//===========================================
CField* CField::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fWidth, float fHeight)
{
	CField* pField = DBG_NEW CField;                                                    //床を生成
	float fResultWidth = fWidth / 2.0f;                                             //床横幅
	float fResultHeight = fHeight / 2.0f;                                           //床高さ
	bool bSuccess = pField->CObject::GetCreateSuccess();                            //生成が成功したかどうか
	if (bSuccess == true)
	{
		if (pField != nullptr)
		{
			pField->Init();                                                                             //初期化処理
			pField->SetUseDeath(false);                                                                  //死亡フラグを発動するかどうかを設定する
			pField->m_bUse = true;                                                                      //使用状態
			pField->SetTextureIndex(CManager::GetTexture()->Regist("data\\TEXTURE\\Floor_002.png"));
			pField->bindTexture(CManager::GetTexture()->GetAddress(pField->GetTextureIndex()));         //テクスチャをセットする　
			pField->CObject::SetType(CObject::TYPE_FIELD);                                              //オブジェクトの種類を決める
			pField->CObject3D::SetWidth(fWidth);                                                        //横幅
			pField->CObject3D::SetHeight(fHeight);                                                      //高さ
		}
	}
	else
	{//オブジェクトに空きがなかったので破棄する
		delete pField;
		pField = nullptr;
	}

	return pField;
}
//===================================================================================