//=========================================================================================================================
//
//６月１７日：画面遷移を実装する[title.cpp]
//Author:ShinaTaiyo
//
//=========================================================================================================================

//=============================================================
//インクルード
//=============================================================
#include "title.h"
#include "bg.h"
#include "manager.h"
#include "renderer.h"
#include "sound.h"
#include "fade.h"
#include "input.h"
//=========================================================================================================================

//=============================================================
//コンストラクタ
//=============================================================
CTitle::CTitle() : m_pPressEnterLogo(nullptr)
{

}
//=========================================================================================================================

//=============================================================
//デストラクタ
//=============================================================
CTitle::~CTitle()
{

}
//=========================================================================================================================

//=============================================================
//初期化処理
//=============================================================
HRESULT CTitle::Init()
{
	CScene::Init();//シーン初期化処理

	//タイトル背景を生成
	CBgTitle::Create(CBg::BG_TITLE);

	//PressEnter表示ロゴを生成
	m_pPressEnterLogo = CUi::Create(CUi::UITYPE_PRESSENTERORSTART_LOGO, CObject2D::POLYGONTYPE01_SENTERROLLING, 200.0f, 200.0f,
		SENTER_VECTOR3 + D3DXVECTOR3(0.0f, 200.0f, 0.0f),NULL_VECTOR3, NULL_VECTOR3, NORMAL_COL);
	m_pPressEnterLogo->SetUseDeath(false);//死亡フラグをfalseに
	m_pPressEnterLogo->SetUseBlinking(true, 60,0.5f);//点滅させる

	CManager::GetSound()->PlaySound(CSound::SOUND_LABEL_BGM_NOESIS);
	return S_OK;
}
//=========================================================================================================================

//=============================================================
//終了処理
//=============================================================
void CTitle::Uninit()
{
	CScene::Uninit();//シーン終了処理

	CManager::GetSound()->StopSound(CSound::SOUND_LABEL_BGM_NOESIS);//タイトルbgmを止める

	if (m_pPressEnterLogo != nullptr)
	{
		m_pPressEnterLogo->SetUseDeath(true);
		m_pPressEnterLogo->SetDeath();
		m_pPressEnterLogo = nullptr;
	}
}
//=========================================================================================================================

//=============================================================
//更新処理
//=============================================================
void CTitle::Update()
{
	CScene::Update();//シーン更新処理

	if (CManager::GetInputKeyboard()->GetTrigger(DIK_RETURN) == true || CManager::GetInputJoypad()->GetTrigger(CInputJoypad::JOYKEY_START) == true)
	{
		CManager::GetSceneFade()->SetSceneFade(CFade::FADEMODE_IN, CScene::MODE_DIFFICULTY);
		CManager::GetSound()->PlaySound(CSound::SOUND_LABEL_SE_DECISION_000);
	}
}
//=========================================================================================================================

//=============================================================
//描画処理
//=============================================================
void CTitle::Draw()
{
	CScene::Draw();//シーン描画処理
}
//=========================================================================================================================