//========================================================================================================
//
//６月１７日：フェード処理実装
//Author:ShinaTaiyo
//
//========================================================================================================

//======================================================
//インクルード
//======================================================
#include "fade.h"
#include "debugtext.h"
#include "manager.h"
#include "scene.h"
//========================================================================================================

//======================================================
//コンストラクタ
//======================================================
CFade::CFade(int nPri, bool bUseintPri, CObject::TYPE type, CObject::OBJECTTYPE ObjType) : CObject2D(nPri,bUseintPri,type,ObjType),
m_FadeMode(FADEMODE_NONE),m_fAlpha(0.0f),m_nFadeCnt(0),m_nMaxFadeCnt(0), m_bStartFade(false)
{

}
//========================================================================================================

//======================================================
//デストラクタ
//======================================================
CFade::~CFade()
{

}
//========================================================================================================

//======================================================
//初期化処理
//======================================================
HRESULT CFade::Init()
{
	CObject2D::Init();         //オブジェクト2D初期化処理
	return S_OK;
}
//========================================================================================================

//======================================================
//終了処理
//======================================================
void CFade::Uninit()
{
	CObject2D::Uninit();//オブジェクト2D終了処理
}
//========================================================================================================

//======================================================
//更新処理
//======================================================
void CFade::Update()
{
	float fRatio = 0.0f;            //フェードの進行度の割合
	bool bModeChenge = false;       //モードが変わったかどうかのフラグ
	switch (m_FadeMode)
	{
	case FADEMODE_IN://フェードイン
		m_nFadeCnt++;//フェードカウントをインクリメント
		if (m_nFadeCnt >= m_nMaxFadeCnt)
		{//最大に達したら最大値に固定
			m_nFadeCnt = m_nMaxFadeCnt;
		}
		fRatio = (float)(m_nFadeCnt) / (float)(m_nMaxFadeCnt);//割合を求める
		SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, fRatio), true, fRatio);//透明度を設定
		break;
	case FADEMODE_OUT:
		m_nFadeCnt--;//フェードカウントをデクリメント
		if (m_nFadeCnt <= 0)
		{//フェードカウントが０になったら
			m_nFadeCnt = 0;//０に固定
			m_bStartFade = false;//フェード開始をfalseにする
		}

		fRatio = (float)(m_nFadeCnt) / (float)(m_nMaxFadeCnt);//割合を求める
		SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, fRatio), true, fRatio);//透明度を設定
		break;
	default:
		break;
	}

	//デバッグ表示
	CManager::GetDebugText()->PrintDebugText("フェードを開始するかどうか：%d\n", m_bStartFade);

	CObject2D::Update();//オブジェクト2D更新処理
}
//========================================================================================================

//======================================================
//描画処理
//======================================================
void CFade::Draw()
{
	D3DXCOLOR col = GetColor();//色合いを取得
	if (col.a > 0.0f)
	{//透明度が０より小さくなったら
		CObject2D::Draw();//オブジェクト2D描画処理
	}
}
//========================================================================================================

//======================================================
//死亡フラグを設定
//======================================================
void CFade::SetDeath()
{
	CObject2D::SetDeath();//オブジェクト2D死亡フラグ設定処理
}
//========================================================================================================

//======================================================
//フェードを設定
//======================================================
void CFade::SetFade(FADEMODE FadeMode)
{
	m_FadeMode = FadeMode;//フェードモードの設定
	switch (FadeMode)
	{
	case FADEMODE_IN://フェードイン
		m_nFadeCnt = 0;
		break;
	case FADEMODE_OUT://フェードアウト
		m_nFadeCnt = m_nMaxFadeCnt;
		break;
	default:
		break;
	}
}
//========================================================================================================

//======================================================
//生成処理
//======================================================
CFade* CFade::Create()
{
	CFade* pFade = DBG_NEW CFade;                                                //フェードを生成
    pFade->Init();                                                               //初期化処理
    pFade->SetUseDeath(false);                                                   //死亡フラグを発動するかどうかを設定する
    pFade->CObject2D::SetAnimInfo(1, 1, true);                                   //ポリゴンとテクスチャ情報を設定
    pFade->SetPos(D3DXVECTOR3(SCREEN_WIDTH / 2,SCREEN_HEIGHT / 2,0.0f));         //中心に位置を設定
    pFade->m_nMaxFadeCnt = 45;                                                   //フェードカウント最大値
    pFade->CObject::SetType(CObject::TYPE::FADE);                                //オブジェクトの種類を決める

	return pFade;
}
//========================================================================================================

//=========================================<<<<<<<<<<<シーンフェードクラス>>>>>>>>>>>======================================================================

//======================================================
//コンストラクタ
//======================================================
CSceneFade::CSceneFade() : m_NextMode(CScene::MODE_TITLE)
{

}
//========================================================================================================

//======================================================
//デストラクタ
//======================================================
CSceneFade::~CSceneFade()
{

}
//========================================================================================================

//======================================================
//初期化処理
//======================================================
HRESULT CSceneFade::Init()
{
	CFade::Init();//フェードの初期化処理
	return S_OK;
}
//========================================================================================================

//======================================================
//終了処理
//======================================================
void CSceneFade::Uninit()
{
	CFade::Uninit();//フェードの終了処理
}
//========================================================================================================

//======================================================
//更新処理
//======================================================
void CSceneFade::Update()
{
	int& nFadeCnt = GetFadeCnt();//フェードカウントを取得
	int& nMaxFadeCnt = GetMaxFadeCnt();//最大フェードカウントを取得する

	CFade::Update();//フェードの更新処理
	if (nFadeCnt >= nMaxFadeCnt)
	{
		SetFadeMode(FADEMODE_OUT);//フェードアウト状態にする
		CManager::SetMode(m_NextMode);//次のモードを設定
	}

	if (nFadeCnt <= 0)
	{//フェードカウントが０になったらフェードモードをなしにする
		SetFadeMode(FADEMODE_NONE);
	}


}
//========================================================================================================

//======================================================
//描画処理
//======================================================
void CSceneFade::Draw()
{
	CFade::Draw();//フェードの描画処理
}
//========================================================================================================

//======================================================
//死亡フラグを設定する
//======================================================
void CSceneFade::SetDeath()
{
	CFade::SetDeath();//フェードの死亡フラグ設定処理
}
//========================================================================================================

//======================================================
//生成処理
//======================================================
CSceneFade* CSceneFade::Create()
{
	CSceneFade* pSceneFade = DBG_NEW CSceneFade;                                      //フェードを生成
	pSceneFade->Init();                                                               //初期化処理
	pSceneFade->SetUseDeath(false);                                                   //死亡フラグを発動するかどうかを設定する
	pSceneFade->SetPos(D3DXVECTOR3(SCREEN_WIDTH / 2,SCREEN_HEIGHT / 2,0.0f));         //中心に位置を設定
	pSceneFade->SetMaxFadeCnt(45);                                                    //フェードカウント最大値
	pSceneFade->CObject::SetType(CObject::TYPE::FADE);                                //オブジェクトの種類を決める
	pSceneFade->SetAnimInfo(1,1,  false);                                             //ポリゴン情報を設定
	pSceneFade->SetWidth(SCREEN_WIDTH / 2);                                           //横幅を設定
	pSceneFade->SetMaxWidth(SCREEN_WIDTH / 2);                                        //最大横幅を設定
	pSceneFade->SetHeight(SCREEN_WIDTH / 2);                                          //高さを設定
	pSceneFade->SetMaxHeight(SCREEN_WIDTH / 2);                                       //最大高さを設定
	pSceneFade->SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f), false, 1.0f);             //色合いを設定
	pSceneFade->SetPolygonType(CObject2D::POLYGONTYPE::NORMAL);                       //ポリゴンの種類を設定
	return pSceneFade;
}
//========================================================================================================

//======================================================
//フェードを設定する
//======================================================
void CSceneFade::SetSceneFade(FADEMODE FadeMode, CScene::MODE mode)
{
	if (GetStartFade() == false)
	{//フェードが開始していなければ
		SetStartFade(true);
		SetFadeMode(FadeMode);

		m_NextMode = mode;    //次のモード
		switch (FadeMode)
		{
		case FADEMODE_IN:
			SetFadeCnt(0);//フェードカウントを０に設定
			break;
		case FADEMODE_OUT:
			SetFadeCnt(GetMaxFadeCnt());//フェードカウントを最大に設定
			break;
		default:
			break;
		}
	}
}
//========================================================================================================