//====================================================================================
//
//６月３日：３Dオブジェクトを描画する[light.h]
//Author:ShinaTaiyo
//
//====================================================================================

//===================================================
//インクルード
//===================================================
#include "light.h"
#include "main.h"
#include "manager.h"
#include "renderer.h"
//=====================================================================================

//===========================================================================
//コンストラクタ
//===========================================================================
CLight::CLight() : m_aLight()
{

}
//========================================================================================================================

//===========================================================================
//デストラクタ
//===========================================================================
CLight::~CLight()
{

}
//========================================================================================================================

//===========================================================================
//初期化処理
//===========================================================================
HRESULT CLight::Init()
{
	LPDIRECT3DDEVICE9 pDevice;                       //デバイスへのポインタ
	pDevice = CManager::GetRenderer()->GetDevice();  //デバイスを取得

	D3DXVECTOR3 vecDir[m_nMAXLIGHT];//設定用方向ベクトル

	for (int nCntLight = 0; nCntLight < m_nMAXLIGHT; nCntLight++)
	{
		//ライトの情報をクリアする
		ZeroMemory(&m_aLight[nCntLight], sizeof(D3DLIGHT9));

		//ライトの種類を設定
		m_aLight[nCntLight].Type = D3DLIGHT_DIRECTIONAL;

		switch (nCntLight)
		{

		case 0:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(0.22f, -0.97f, -0.54f);
			break;
		case 1:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(0.65f, 0.65f, 0.65f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(-0.38f, 0.88f, -0.44f);
			break;
		case 2:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(0.0f, 0.0f, 1.0f);
			break;
		case 3:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(0.22f, -0.87f, 0.44f);
			break;
		case 4:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(0.65f, 0.65f, 0.65f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(-0.18f, 0.88f, -0.44f);
			break;
		case 5:
			//ライトの拡散光を設定
			m_aLight[nCntLight].Diffuse = D3DXCOLOR(0.15f, 0.15f, 0.15f, 1.0f);
			//ライトの方向を設定
			vecDir[nCntLight] = D3DXVECTOR3(0.89f, -0.11f, 0.44f);
			break;

		}


		D3DXVec3Normalize(&vecDir[nCntLight], &vecDir[nCntLight]);//ベクトルを正規化する（長さを1にする）
		m_aLight[nCntLight].Direction = vecDir[nCntLight];

		//ライトを設定する（設置）
		pDevice->SetLight(nCntLight, &m_aLight[nCntLight]);

		//ライトを有効にする（スイッチをオンにする）
		pDevice->LightEnable(nCntLight, TRUE);
	}

	return S_OK;
}
//========================================================================================================================

//===========================================================================
//終了処理
//===========================================================================
void CLight::Uninit()
{

}
//========================================================================================================================

//===========================================================================
//更新処理
//===========================================================================
void CLight::Update()
{

}
//========================================================================================================================