//===============================================================================
//
//６月１７日：画面遷移を実装する[result.h]
//Author:ShinaTaiyo
//
//===============================================================================

#ifndef _RESULT_H_  
#define _RESULT_H_


//========================================
//インクルード
//========================================
#include "scene.h"
//===============================================================================

//========================================
//ゲームクラス
//========================================
class CResult : public CScene
{
public:
	CResult();                          //コンストラクタ
	~CResult() override;                //デストラクタ
	HRESULT Init() override;            //初期化処理
	void Uninit() override;             //終了処理
	void Update() override;             //更新処理
	void Draw() override;               //描画処理
private:
};
#endif