//==========================================================
//
// ２０２５年1月１０日：C++のデバッグ処理を実装する [debugtext.h]
// Author ShinaTaiyo
//
//==========================================================
#ifndef _DEBUGTEXT_H_		//このマクロが定義されていない場合
#define _DEBUGTEXT_H_

//=================================================
//ファイルインクルード
//=================================================
#include "main.h"


//=================================================
//デバッグテキストクラス
//=================================================
class CDebugText
{
public:

	CDebugText();  //コンストラクタ
	~CDebugText(); //デストラクタ
	HRESULT Init();//初期化処理
	void Uninit(); //終了処理
	void Update(); //更新処理
	void Draw();   //描画処理
	void PrintDebugText(const string Format, ...);//デバッグテキストを入力する
private:
	//=====================
	//静的メンバ
	//=====================
	static LPD3DXFONT s_pFont;	       //フォントへのポインタ!
	static string s_DrawString;        //描画する文字列
	static bool s_bDispDebug;	       //デバッグ表示のON/OFF!
	//==============================================================
};
//=====================================================================================================================================
#endif